//==========================================================================================
//	数字表示ヘッダ[number.h]
//	Author : KAZUNORI MARUHASHI
//
//	Update :
//		YYYY/MM/DD	Updater :
//
//		2017/05/26	Updater : KAZUNORI MARUHASHI
//			・初版作成
//			
//	
//==========================================================================================

//==========================================================================================
// インクルードファイル
//==========================================================================================
#ifndef _NUMBER_H_	//二重インクルード防止
#define _NUMBER_H_


//==========================================================================================
// マクロ定義
//==========================================================================================


//==========================================================================================
// 構造体定義
//==========================================================================================

//==========================================================================================
// プロトタイプ宣言
//==========================================================================================
void InitNumber(void);		//ポリゴン初期化処理
void UninitNumber(void);		//ポリゴン終了処理
void UpdateNumber(void);		//ポリゴン更新処理

//整数の描画(描画する数字, 桁数, 一桁目の場所, サイズ, 桁ごとの幅)
void DrawNumber(int iNumber, int iDigit, D3DXVECTOR2 Pos, D3DXVECTOR2 Size, float fMargin, LPDIRECT3DTEXTURE9 pTexture);

//実数の描画(描画する数字, 描画桁数, 小数点以下の描画桁数, 整数一桁目の場所, サイズ, 桁ごとの幅)
void DrawNumberFloat(float iNumber, int iDigit, int fFloatDigit, D3DXVECTOR2 Pos, D3DXVECTOR2 Size, float fMargin, LPDIRECT3DTEXTURE9 pTexture);
void SetNumber(int iNumber, D3DXVECTOR2 Pos, D3DXVECTOR2 Size);
void SetColor(D3DXCOLOR color);

//==========================================================================================
// グローバル変数
//==========================================================================================

#endif