/*****************************************************************************
tutorial.cpp
Aythor	: 上野　匠
Data	: 2017_06_21
=============================================================================
Updata

*****************************************************************************/
#ifndef TUTORIAL_H
#define TUTORIAL_H
//////////////////////////////////////////////////////////////////////////////
//プロトタイプ宣言
//////////////////////////////////////////////////////////////////////////////
HRESULT	initTuto(void);
void	uninitTuto(void);
void	updateTuto(void);
void	drawTuto(void);
void	addAchive(void);
void	startPopdown(void);

#endif // !TUTORIAL_H